zhoudd/frontend/models/Gropshop.php

    public function hotel_about($id)
    {
         $selects = $this->find()
            ->innerjoin('grop_type','gropshop.g_type_id = grop_type.t_id')
            ->where(['gropshop.g_id'=>$id])
            ->select('*')
            ->asArray()
            ->one();
---
SELECT * FROM `gropshop` INNER JOIN `grop_type` ON gropshop.g_type_id = grop_type.t_id WHERE `gropshop`.`g_id`='15'