zhoudd/frontend/models/Travel.php

    public function searchsix()
    {
        return $this->find()->select('*')
            ->innerJoin('city',"travel.c_id = city.c_id")
            ->innerJoin('season',"travel.s_id = season.s_id")
            ->orderBy(['click_num'=>SORT_DESC])
            ->limit(6)
            ->asArray()
            ->all();
---
SELECT * FROM `travel` INNER JOIN `city` ON travel.c_id = city.c_id INNER JOIN `season` ON travel.s_id = season.s_id ORDER BY `click_num` DESC LIMIT 6

    public function seasons()
    {
        $time = date('m',time());
        if($time>=3 && $time<6)
        {
            $season = 1;
        }
        else if($time>=6 && $time<9)
        {
            $season = 2;
        }
        else if($time>=9 && $time<11)
        {
            $season = 3;
        }
        else
        {
            $season = 4;
        }
		$info = $this->find()
            ->innerJoin('city',"travel.c_id = city.c_id")
            ->innerJoin('season',"travel.s_id = season.s_id")
            ->where(['travel.s_id'=>$season])
           ->orderBy(['click_num'=>SORT_DESC])
		   ->select('*')
		   ->limit(3)
		   ->all();
---
SELECT * FROM `travel` INNER JOIN `city` ON travel.c_id = city.c_id INNER JOIN `season` ON travel.s_id = season.s_id WHERE `travel`.`s_id`=1 ORDER BY `click_num` DESC LIMIT 3

    public function hotcity()
    {
        $city = $this->find()->select("c_id")->asArray()->all();
        foreach($city as $k=>$v)
        {
            $arr[$k]=$v['c_id'];
        }
       $hots= array_count_values($arr);
        arsort($hots);
        foreach($hots as $k=>$v)
        {
            $city = new City();
            $citys[] = $city->find()->where(['c_id'=>$k])->asArray()->one();
---
SELECT `c_id` FROM `travel`
SELECT * FROM `city` WHERE `c_id`=1

    public function allview()
    {
        $sql = $this->find();
        $quer = clone $sql;
        $pages = new Pagination([
            'totalCount'=>$quer->count(),
            'defaultPageSize'=>8,
        ]);
        $info = $sql->offset($pages->offset)
            ->limit($pages->limit)
            ->all();
---
SELECT COUNT(*) FROM `travel`
SELECT * FROM `travel` LIMIT 8